app/Http/Middleware/RolesMiddleware.php

    public function handle(Request $request, Closure $next, ...$roles): Response
    {
        if (!auth()->check()) {
            // ผู้ใช้ยังไม่ล็อกอิน → redirect login
            return redirect()->route('login')->with('error', 'กรุณาเข้าสู่ระบบก่อน');
        }

        $user = auth()->user();
        $user->load('role'); // Ensure role is loaded
---
SELECT * FROM "roles" WHERE "roles"."role_id" in (1)