app/Http/Controllers/Client/CartController.php

SELECT * FROM "cart_items" WHERE "cart_items"."cart_id" in (5)
SELECT * FROM "products" WHERE "products"."product_id" in (1)
SELECT * FROM "products" WHERE "products"."product_id" = '1' LIMIT 1
---
    public function index(): View
    {
        $user = auth()->user();
        $cartItems = CartItem::with('product')->where('user_id', $user->user_id)->get();

        // Create a simple cart-like object for the view
        $cart = (object) [
            'items' => $cartItems,
            'total_items' => $cartItems->sum('quantity'),
            'total_price' => $cartItems->sum(function ($item) {
                return $item->quantity * $item->product->price;
            }),
        ];

SELECT * FROM "products" WHERE "products"."product_id" = 1 LIMIT 1
SELECT * FROM "cart_items" WHERE "user_id" = 9 and "product_id" = 1 LIMIT 1
---
    public function add(Request $request, int $productId): JsonResponse
    {
        try {
            $request->validate([
                'quantity' => 'nullable|integer|min:1|max:99',
            ]);

            $user = auth()->user();
            if (!$user) {
                return response()->json([
                    'success' => false,
                    'message' => 'กรุณาเข้าสู่ระบบก่อน',
                ], 401);
            }

            $quantity = $request->quantity ?? 1;

            // ตรวจสอบสินค้า
            $product = Product::findOrFail($productId);

        if ($product->stock_quantity < $quantity) {
            return response()->json([
                'success' => false,
                'message' => 'สินค้าในสต็อกไม่เพียงพอ',
            ], 400);
        }

        // ตรวจสอบว่ามีสินค้านี้ในตะกร้าแล้วหรือไม่
        $existingItem = CartItem::where('user_id', $user->user_id)
            ->where('product_id', $productId)
            ->first();

UPDATE "cart_items" SET "quantity" = 4, "updated_at" = '2025-11-22 07:19:27' WHERE "cart_item_id" = 13
INSERT INTO "cart_items" ("user_id", "product_id", "quantity", "price_at_add", "added_at", "updated_at", "created_at") VALUES (9, 1, 1, '4000.00', '2025-11-24 01:49:15', '2025-11-24 01:49:15', '2025-11-24 01:49:15')
SELECT sum("quantity") as aggregate FROM "cart_items" WHERE "user_id" = 9
---
                ], 400);
            }

            $existingItem->update(['quantity' => $newQuantity]);
        } else {
            CartItem::create([
                'user_id' => $user->user_id,
                'product_id' => $productId,
                'quantity' => $quantity,
                'price_at_add' => $product->price,
                'added_at' => now(),
            ]);
        }

        $cartCount = CartItem::where('user_id', $user->user_id)->sum('quantity');

SELECT * FROM "cart_items" WHERE "user_id" = 9 and "product_id" = 1 LIMIT 1
SELECT * FROM "products" WHERE "products"."product_id" in (1)
UPDATE "cart_items" SET "quantity" = 2, "updated_at" = '2025-11-22 07:27:32' WHERE "cart_item_id" = 13
---
    public function update(Request $request): JsonResponse
    {
        try {
            $request->validate([
                'product_id' => 'required|integer',
                'quantity' => 'required|integer|min:1|max:99',
            ]);

            $user = auth()->user();
            if (!$user) {
                return response()->json([
                    'success' => false,
                    'message' => 'กรุณาเข้าสู่ระบบก่อน',
                ], 401);
            }

            $cartItem = CartItem::with('product')
                ->where('user_id', $user->user_id)
                ->where('product_id', $request->product_id)
                ->firstOrFail();

            // ตรวจสอบ stock
            if ($request->quantity > $cartItem->product->stock_quantity) {
                return response()->json([
                    'success' => false,
                    'message' => 'สินค้าในสต็อกไม่เพียงพอ',
                ], 400);
            }

            $cartItem->update(['quantity' => $request->quantity]);

SELECT * FROM "cart_items" WHERE "user_id" = 9 and "product_id" = 1 LIMIT 1
DELETE FROM "cart_items" WHERE "cart_item_id" = 13
---
    public function remove(Request $request): JsonResponse
    {
        try {
            $request->validate([
                'product_id' => 'required|integer',
            ]);

            $user = auth()->user();
            if (!$user) {
                return response()->json([
                    'success' => false,
                    'message' => 'กรุณาเข้าสู่ระบบก่อน',
                ], 401);
            }

            $cartItem = CartItem::where('user_id', $user->user_id)
                ->where('product_id', $request->product_id)
                ->firstOrFail();

            $cartItem->delete();