app/Http/Controllers/Client/CheckoutController.php

    public function index(): View|RedirectResponse
    {
        $user = auth()->user();
        $cartItems = CartItem::with('product')->where('user_id', $user->user_id)->get();

        if ($cartItems->isEmpty()) {
            return redirect()->route('account.cart.index')
                ->with('error', 'ตะกร้าของคุณว่างเปล่า กรุณาเพิ่มสินค้าก่อน');
        }

        // Create a cart-like object for the view
        $cart = (object) [
            'items' => $cartItems,
            'total_items' => $cartItems->sum('quantity'),
---
SELECT * FROM "cart_items" WHERE "cart_items"."cart_id" in (5)
SELECT * FROM "products" WHERE "products"."product_id" in (1)
SELECT * FROM "cart_items" WHERE "user_id" = 9

    public function process(Request $request): RedirectResponse
    {
        $request->validate([
            'payment_method' => 'required|in:credit,qr,cod',
            'shipping_address' => 'required|string|max:500',
        ]);

        $user = auth()->user();
        $cartItems = CartItem::with('product')->where('user_id', $user->user_id)->get();
---
SELECT * FROM "cart_items" WHERE "user_id" = 9
SELECT * FROM "products" WHERE "products"."product_id" in (1)