app/Http/Controllers/Client/ClientProductController.php

        $products = $query->paginate(12)->withQueryString();

        // Get filter options (cached for 1 hour)
        $categories = Cache::remember('active_categories', 3600, fn() =>
            Category::whereHas('products', fn($q) => $q->where('status', 'active'))
                ->select('category_id', 'category_name')
                ->get()
        );

        $brands = Cache::remember('active_brands', 3600, fn() =>
            Brand::whereHas('products', fn($q) => $q->where('status', 'active'))
                ->select('brand_id', 'brand_name')
                ->get()
        );
---
SELECT "category_id", "category_name" FROM "categories" WHERE exists (SELECT * FROM "products" WHERE "categories"."category_id" = "products"."category_id" and "status" = 'active')
SELECT "brand_id", "brand_name" FROM "brands" WHERE exists (SELECT * FROM "products" WHERE "brands"."brand_id" = "products"."brand_id" and "status" = 'active')

    public function show(int $id): View
    {
        try {
            // Get product with relationships
            $product = Product::with([
                'category:category_id,category_name',
                'brand:brand_id,brand_name'
            ])
            ->where('status', 'active')
            ->findOrFail($id);

            // Increment view count
            // $this->incrementViewCount($product); // Temporarily disabled due to caching issue

            // Get related products (same category, exclude current)
            $relatedProducts = Product::where('category_id', $product->category_id)
                ->where('product_id', '!=', $id)
                ->where('status', 'active')
                ->where('stock_quantity', '>', 0)
                ->inRandomOrder()
                ->limit(4)
                ->get();
---
SELECT "brand_id", "brand_name" FROM "brands" WHERE "brands"."brand_id" in (2)
SELECT "category_id", "category_name" FROM "categories" WHERE "categories"."category_id" in (7)
SELECT * FROM "products" WHERE "status" = 'active' and "products"."product_id" = 1 LIMIT 1
SELECT * FROM "products" WHERE "category_id" = 7 and "product_id" != 1 and "status" = 'active' and "stock_quantity" > 0 ORDER BY RANDOM() LIMIT 4

    private function incrementViewCount(Product $product): void
    {
        // Use increment to avoid race condition
        $product->increment('view_count');
---
UPDATE "products" SET "view_count" = "view_count" + 1, "updated_at" = '2025-11-22 05:14:38' WHERE "product_id" = 1