app/Models/Member.php

SELECT exists(SELECT * FROM "orders" WHERE "orders"."member_id" = 4 and "orders"."member_id" IS not NULL and exists (SELECT * FROM "order_items" WHERE "orders"."order_id" = "order_items"."order_id" and "product_id" = 1) and "order_status" = 'delivered') as "exists"
---
    public function canReviewProduct(int $productId): bool
    {
        // Check if member has purchased this product
        return $this->orders()
            ->whereHas('orderItems', function ($query) use ($productId) {
                $query->where('product_id', $productId);
            })
            ->where('order_status', 'delivered')
            ->exists();

SELECT exists(SELECT * FROM "reviews" WHERE "reviews"."member_id" = 4 and "reviews"."member_id" IS not NULL and "product_id" = 1) as "exists"
---
    public function hasReviewedProduct(int $productId): bool
    {
        return $this->reviews()->where('product_id', $productId)->exists();