app/Http/Controllers/Admin/AdminUserController.php

SELECT * FROM "roles" WHERE "roles"."role_id" in (1, 2)
---
    public function index()
    {
        $users = User::with('role')->latest()->get();