app/Http/Controllers/Admin/AdminProductController.php

    public function index(Request $request)
    {
        $sortBy = $request->get('sort', 'product_id'); // Default sort by ID
        $sortDirection = $request->get('direction', 'asc'); // Default ascending for ID

        // Validate sort parameters
        $allowedSorts = ['product_id', 'product_name', 'price', 'stock_quantity', 'created_at', 'updated_at'];
        if (!in_array($sortBy, $allowedSorts)) {
            $sortBy = 'product_id';
        }

        if (!in_array($sortDirection, ['asc', 'desc'])) {
            $sortDirection = 'desc';
        }

        $products = Product::with(['category', 'brand'])
            ->orderBy($sortBy, $sortDirection)
            ->paginate(15); // Add pagination for better performance
---
SELECT * FROM "brands" WHERE "brands"."brand_id" in (2)
SELECT * FROM "categories" WHERE "categories"."category_id" in (7)
SELECT * FROM "products" ORDER BY "created_at" DESC

    public function create()
    {
        return view('admin.products.create', [
            'categories' => Category::select('category_id', 'category_name')->get(),
            'brands' => Brand::select('brand_id', 'brand_name')->get()
        ]);
---
SELECT "category_id", "category_name" FROM "categories"
SELECT "brand_id", "brand_name" FROM "brands"


            DB::commit();

            return redirect()
                ->route('admin.products.index')
                ->with('success', 'เพิ่มสินค้าสำเร็จ');
---
SELECT * FROM "products" WHERE "products"."product_id" = 1 LIMIT 1