app/Http/Controllers/Admin/AdminOrderController.php

SELECT * FROM "order_items" WHERE "order_items"."order_id" in (7, 8)
SELECT * FROM "orders" ORDER BY "created_at" DESC
SELECT * FROM "products" WHERE "products"."product_id" in (1)
SELECT * FROM "users" WHERE "users"."user_id" in (9)
---
    public function index()
    {
        $orders = Order::with(['user', 'orderItems.product'])->latest()->get();