app/Http/Controllers/Admin/DashboardController.php

    public function index()
    {
        $stats = [
            'total_products' => Product::count(),
            'total_orders' => Order::count(),
            'total_users' => User::count(),
            'total_sales' => Order::sum('total_amount') ?? 0,
        ];

        // Monthly orders data
        $monthlyOrders = [];
        for ($i = 1; $i <= 12; $i++) {
            $monthlyOrders[] = Order::whereYear('created_at', date('Y'))
                ->whereMonth('created_at', $i)
                ->count();
        }

        // Monthly sales data
        $monthlySales = [];
        for ($i = 1; $i <= 12; $i++) {
            $monthlySales[] = Order::whereYear('created_at', date('Y'))
                ->whereMonth('created_at', $i)
                ->sum('total_amount') ?? 0;
---
SELECT count(*) as aggregate FROM "products"
SELECT count(*) as aggregate FROM "orders"
SELECT count(*) as aggregate FROM "users"
SELECT sum("total_amount") as aggregate FROM "orders"
SELECT count(*) as aggregate FROM "orders" WHERE extract(year FROM "created_at") = '2025' and extract(month FROM "created_at") = '01'
SELECT sum("total_amount") as aggregate FROM "orders" WHERE extract(year FROM "created_at") = '2025' and extract(month FROM "created_at") = '01'