app/Http/Controllers/Admin/DashboardController.php

    public function index()
    {
        // Get cached dashboard statistics
        $stats = $this->cacheService->getDashboardStats();


        // Calculate monthly data using efficient aggregation
        $monthlyData = $this->getMonthlyAnalytics();

        // Extract arrays for view compatibility
        $monthlyOrders = $monthlyData['orders'];
        $monthlySales = $monthlyData['sales'];

        // Get recent orders with eager loading
        $recentOrders = Order::with([
            'user' => function($query) {
                $query->select('user_id', 'firstname', 'lastname');
            },
            'orderItems' => function($query) {
                $query->with(['product' => function($productQuery) {
                    $productQuery->select('product_id', 'product_name');
                }]);
            }
        ])
        ->latest()
        ->limit(10)
        ->get();
---
SELECT "user_id", "firstname", "lastname" FROM "users" WHERE "users"."user_id" in (9)
SELECT * FROM "order_items" WHERE "order_items"."order_id" in (7, 8)