app/Http/Controllers/Account/OrderController.php

    public function index()
    {
        // ดึงข้อมูล orders ของ user ที่ login อยู่ (มี pagination)
        $orders = Auth::user()->orders()
            ->orderBy('created_at', 'desc')
            ->paginate(10);
---
SELECT * FROM "orders" WHERE "orders"."user_id" = 9 and "orders"."user_id" IS not NULL ORDER BY "created_at" DESC LIMIT 10 offset 0
SELECT count(*) as aggregate FROM "orders" WHERE "orders"."user_id" = 9 and "orders"."user_id" IS not NULL

    public function show($id)
    {
        // ดูรายละเอียด order แต่ละรายการ
        $order = Auth::user()->orders()->where('order_id', $id)->firstOrFail();
---
SELECT * FROM "orders" WHERE "orders"."user_id" = 9 and "orders"."user_id" IS not NULL and "order_id" = '8' LIMIT 1